emsesp/EMS-ESP32/src/core/system.cpp
    // if exclude list is provided, parse it and remove excluded GPIOs
    if (!exclude.empty()) {
        std::vector<uint8_t, AllocatorPSRAM<uint8_t>> exclude_gpios;
        pos  = 0;
        prev = 0;

        auto process_exclude = [&exclude_gpios](std::string part) {
            // trim whitespace
            part.erase(0, part.find_first_not_of(" \t"));
            part.erase(part.find_last_not_of(" \t") + 1);

            // check if it's a range (contains '-')
            std::string::size_type dash_pos = part.find('-');
            if (dash_pos != std::string::npos) {
                // it's a range like "6-11"
                int start = std::stoi(part.substr(0, dash_pos));
                int end   = std::stoi(part.substr(dash_pos + 1));
                for (int i = start; i <= end; i++) {
                    exclude_gpios.push_back(static_cast<uint8_t>(i));
                }
            } else {
                exclude_gpios.push_back(static_cast<uint8_t>(std::stoi(part)));
            }
        };

        while ((pos = exclude.find(',', prev)) != std::string::npos) {
            process_exclude(exclude.substr(prev, pos - prev));
            prev = pos + 1;
        }

        // handle the last part
        process_exclude(exclude.substr(prev));

        // remove excluded GPIOs from the main list
        gpios.erase(std::remove_if(gpios.begin(), gpios.end(), [&exclude_gpios](uint8_t gpio) {
            return std::find(exclude_gpios.begin(), exclude_gpios.end(), gpio) != exclude_gpios.end();
        }), gpios.end());
    }

    return gpios;
}

// initialize a list of valid GPIOs based on the ESP32 board
// string_to_vector() take two strings, the first is the range of GPIOs to use, the second is the range of GPIOs to exclude
// note: we always allow 0, which is used to indicate Dallas or LED is disabled
void System::set_valid_system_gpios() {
    valid_system_gpios_.clear(); // reset system list
    used_gpios_.clear();         // reset used list

    // get free gpios based on board/platform type
#if CONFIG_IDF_TARGET_ESP32C3
    // not valid:
    //   20-21 are UART0
    valid_system_gpios_ = string_range_to_vector("0-10", "20-21");
#elif CONFIG_IDF_TARGET_ESP32S2
    // not valid:
    //   6-11 are used for SPI flash and PSRAM
    //   16-17 are also used for SPI flash and PSRAM
    //   45-46 are strapping pins
    //   43-44 are UART0
    // notes:
    //   34-39 are input only
    valid_system_gpios_ = string_range_to_vector("0-46", "6-11, 16-17, 45-46, 43-44");
#elif CONFIG_IDF_TARGET_ESP32S3
    // not valid:
    //   43-44 are UART0 pins
    //   19-20 are USB-JTAG pins
    //   33-37 for Octal SPI (SPIIO4 through SPIIO7 and SPIDQS) on 32MB boards
    //   3, 45-46 are strapping pins
    //   26-32 are typically used for SPI flash and PSRAM
    //   42 transitions low on reset, slower than other GPIOs which can cause issues in time-sensitive applications
    // notes:
    //   34-39 are input only, and can be used
    //   47 and 48 are valid on a Wemos S3 (https://github.com/emsesp/EMS-ESP32/issues/2874)
    valid_system_gpios_ = string_range_to_vector("0-48", "43-44, 19-20, 33-37, 3, 45-46, 26-32, 42");
#elif CONFIG_IDF_TARGET_ESP32
    // not valid:
    //   6-11 are used for SPI flash and PSRAM
    //   16-17 are also used for SPI flash and PSRAM
    //   26-32 are used for SPI flash and PSRAM
    //   33-37 also used for SPI flash and PSRAM, on Octal SPI PSRAM (ESP32-S3R8, ESP32-S3R8V, ESP32-S3R16V)
    //   9-10 are used for SPI flash and PSRAM
    //   19-20 used for JTAG-USB
    //   45-46 are strapping pins
    //   1 and 3 are UART0 pins, but used for some eth-boards (BBQKees-E32, OlimexPOE)
    //   42 transitions low on reset, slower than other GPIOs which can cause issues in time-sensitive applications
    // notes:
    //   34-39 are input only (ADC1), and can be used
    //   25 and 26 are DAC (Digital-to-Analog Converter) pins, and can be used
    if (ESP.getPsramSize() > 0) {
        // if psram is enabled remove pins 16 and 17 from the list
        valid_system_gpios_ = string_range_to_vector("0-39", "6-11, 16-17, 26-32, 33-37, 9-10, 19-20, 45-46, 1, 3, 42");
    } else {
        valid_system_gpios_ = string_range_to_vector("0-39", "19-20, 45-46, 1, 3, 42");
    }
#elif defined(EMSESP_STANDALONE)
    valid_system_gpios_ = string_range_to_vector("0-39");
#endif
}

// check if a pin is valid ESP32 pin and if not already used, add to the used gpio list
// return false if not allowed or already used
bool System::add_gpio(uint8_t pin, const char * source_name) {
    // check if this is a valid user GPIO
    if (std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin) != valid_system_gpios_.end()) {
        // It's valid now check if it's already in the used list
        auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [pin, source_name](const GpioInfo & gpio_info) { return gpio_info.pin == pin && gpio_info.name != source_name; });
        if (it != used_gpios_.end()) {
            LOG_WARNING("Can't add GPIO %d for %s, already in use by %s", pin, source_name, it->name.c_str());
            return false; // Pin is already used
        }
    } else {
        // not valid
        LOG_WARNING("GPIO %d for %s is not valid", pin, source_name);
        return false;
    }

    // remove the old pin, if exists from used list
    remove_gpio(pin);

    LOG_DEBUG("Adding GPIO %d for %s to used gpio list", pin, source_name);
    used_gpios_.push_back({pin, source_name}); // add to used list with name

    return true;
}

// remove a gpio from both valid and used lists
void System::remove_gpio(uint8_t pin, bool also_system) {
    auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [pin](const GpioInfo & gpio_info) { return gpio_info.pin == pin; });
    if (it != used_gpios_.end()) {
        LOG_DEBUG("GPIO %d removed from used gpio list", pin);
        used_gpios_.erase(it);
    }

    if (also_system) {
        auto it_sys = std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin);
        if (it_sys != valid_system_gpios_.end()) {
            LOG_DEBUG("GPIO %d removed from valid gpio list", pin);
            valid_system_gpios_.erase(it_sys);
        }
    }
}

// return a list of GPIO's available for use
std::vector<uint8_t> System::available_gpios() {
    std::vector<uint8_t> gpios;
    for (const auto & gpio : valid_system_gpios_) {
        auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [gpio](const GpioInfo & gpio_info) { return gpio_info.pin == gpio; });
        if (it == used_gpios_.end()) {
            gpios.push_back(gpio); // didn't find it in used_gpios_, so it's available
        }
    }
    return gpios;
}

// make a snapshot of the current GPIOs
void System::make_snapshot_gpios(std::vector<int8_t> & u_gpios, std::vector<int8_t> & s_gpios) {
    for (const auto & gpio_info : used_gpios_) {
        u_gpios.push_back(gpio_info.pin);
    }
    for (const auto & gpio : valid_system_gpios_) {
        s_gpios.push_back(gpio);
    }
}

// restore the GPIOs from the snapshot
void System::restore_snapshot_gpios(std::vector<int8_t> & u_gpios, std::vector<int8_t> & s_gpios) {
    used_gpios_.clear();
    for (const auto & gpio : u_gpios) {
        used_gpios_.push_back({static_cast<uint8_t>(gpio), "restored"});
    }

    valid_system_gpios_.clear();
    for (const auto & gpio : s_gpios) {
        valid_system_gpios_.push_back(gpio);
    }
}

} // namespace emsesp
